rails-intro/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY title
---
  def index
    session[:ratings] ||= Movie.all_ratings
    #redirect_to movies_path(@ratings = session[:ratings]) if @ratings.nil?
#redirect_to movies_path([:sort => session[:sort]]) if @sort.nil?
    redirect_to movies_path([:sort => session[:sort], :ratings => params[:ratings]]) if params[:sort].nil?
    session[:sort] = @sort unless @sort.nil?
    @sort = session[:sort]

    @ratings = params[:ratings]
    logger.debug(@ratings)
    @ratings_ary = @ratings ? @ratings.keys : @all_ratings unless @ratings.nil?

    @ratings_ary = session[:ratings] if @ratings_ary.nil?
    logger.debug(@ratings_ary)
    session[:ratings] = @ratings_ary if @ratings_ary.length > 0
    logger.debug(session[:ratings])
    @movies = Movie.where(:rating => session[:ratings]).order(session[:sort])